<template>
  <footer class="yz-footer">
    <div class="footer-container">
      
      <div class="footer-left">
        <div class="nav-links">
          <a v-for="(link, index) in navLinks" :key="index" :href="link.url" target="_blank">{{ link.name }}</a>
        </div>
        
        <div class="info-row">
          主办单位：<a href="https://chesicc.chsi.com.cn/" target="_blank">教育部学生服务与素质发展中心</a>
        </div>
        
        <div class="info-row">
          Copyright © 2003-2026 <a href="https://www.chsi.com.cn/" target="_blank">学信网</a> All Rights Reserved
        </div>
        
        <div class="info-row beian-info">
          <a href="https://beian.miit.gov.cn/#/Integrated/index" target="_blank">京ICP备19004913号-1</a>
          <a href="https://beian.mps.gov.cn/#/query/webSearch?code=11010202009747" target="_blank" class="gongan-beian">
            <img src="https://t1.chei.com.cn/chsi/images/jgwab.svg" alt="公安备案图标">
            京公网安备11010202009747号
          </a>
        </div>
      </div>

      <div class="footer-right">
        <div class="social-links">
          
          <a href="https://yz.chsi.com.cn/kyzx/kp/wbwx.shtml" target="_blank" class="social-btn">
            <svg class="social-icon" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg">
              <path fill="currentColor" d="M6.33075,2 C3.4003125,2 1,3.99745313 1,6.53370312 C1,7.99773437 1.7986875,9.19954687 3.13267188,10.1306562 L2.5995,11.734625 L4.46289062,10.7997656 C5.129875,10.9321719 5.6646875,11.0676406 6.33003125,11.0676406 C6.49725,11.0676406 6.66329688,11.0594062 6.8276875,11.0462344 C6.72373438,10.6894531 6.66329688,10.3164531 6.66329688,9.92932812 C6.66329688,7.6016875 8.66332812,5.71171875 11.1955781,5.71171875 C11.3682031,5.71171875 11.5391875,5.72442187 11.709,5.74323437 C11.2477969,3.59573437 8.95190625,2 6.33075,2 L6.33075,2 Z M4.5990625,5.5990625 C4.19971875,5.5990625 3.796375,5.33142188 3.796375,4.93184375 C3.796375,4.53060938 4.19971875,4.26673438 4.5990625,4.26673438 C4.99840625,4.26673438 5.26464063,4.53085938 5.26464063,4.93184375 C5.26440625,5.33142188 4.99840625,5.59907813 4.5990625,5.59907813 L4.5990625,5.5990625 Z M8.32984375,5.5990625 C7.93025,5.5990625 7.52925,5.33142188 7.52925,4.93184375 C7.52925,4.53060938 7.93025,4.26673438 8.32982812,4.26673438 C8.73129687,4.26673438 8.9970625,4.53085938 8.9970625,4.93184375 C8.9970625,5.33142188 8.7310625,5.59907813 8.32982812,5.59907813 L8.32984375,5.5990625 Z M16.061125,9.86559375 C16.061125,7.73575 13.9284688,5.99865625 11.5333125,5.99865625 C8.9970625,5.99865625 6.999375,7.73575 6.999375,9.86559375 C6.999375,12.0001562 8.9970625,13.7337187 11.5333125,13.7337187 C12.064125,13.7337187 12.5991719,13.600125 13.1325781,13.4663125 L14.5949687,14.2668906 L14.1939844,12.9345469 C15.2638438,12.1323281 16.061125,11.067875 16.061125,9.86559375 L16.061125,9.86559375 Z M10.0631563,9.19954687 C9.797625,9.19954687 9.52975,8.93590625 9.52975,8.66660938 C9.52975,8.400625 9.797625,8.13296875 10.0631563,8.13296875 C10.4665,8.13296875 10.7303906,8.400625 10.7303906,8.66660938 C10.7303906,8.93590625 10.4665,9.19954687 10.0631563,9.19954687 Z M12.9954687,9.19954687 C12.7318281,9.19954687 12.4658281,8.93590625 12.4658281,8.66660938 C12.4658281,8.400625 12.7318281,8.13296875 12.9954687,8.13296875 C13.3948125,8.13296875 13.6626875,8.400625 13.6626875,8.66660938 C13.6626875,8.93590625 13.3948125,9.19954687 12.9954687,9.19954687 Z"></path>
            </svg>
            官方微信
          </a>

          <a href="https://yz.chsi.com.cn/kyzx/kp/wbwx.shtml" target="_blank" class="social-btn">
            <svg class="social-icon" viewBox="0 0 16 16" xmlns="http://www.w3.org/2000/svg">
              <path fill="currentColor" d="M10.565,3.6325 C10.565,3.6325 12.335,3.445 13.0875,4.5425 C13.84,5.64 13.515,7.02 13.515,7.02 C13.4949253,7.12321653 13.5233752,7.22993417 13.5921672,7.30945968 C13.6609592,7.38898519 13.7624686,7.43250415 13.8675,7.4275 L14.0425,7.4275 C14.2747485,7.42111375 14.4682944,7.24766281 14.5,7.0175 C14.5,7.0175 14.9075,4.8525 13.65,3.6475 C12.67,2.705 11.3275,2.6025 10.79,2.6025 L10.5525,2.6025 C10.3240422,2.60790517 10.1412883,2.79398193 10.1399581,3.0225 L10.1399581,3.2275 C10.1383884,3.33892927 10.183335,3.44597927 10.264011,3.52285878 C10.3446871,3.59973829 10.4537777,3.63947671 10.565,3.6325 L10.565,3.6325 Z M7.08,11.845 C8.315,11.595 9.15,10.565 8.9475,9.5225 C8.7725,8.625 7.8875,8.0225 6.8575,8.0225 C6.6895953,8.02269714 6.52211889,8.03944478 6.3575,8.0725 C5.1225,8.3225 4.2875,9.3525 4.49,10.395 C4.6925,11.4375 5.8475,12.085 7.08,11.845 Z M7.115,9.1625 C7.27228055,9.15431868 7.41868486,9.24275691 7.48462743,9.38578027 C7.55057,9.52880363 7.52275233,9.69756891 7.41439607,9.8118625 C7.3060398,9.9261561 7.13899693,9.96292865 6.99266239,9.90470229 C6.84632786,9.84647593 6.75021264,9.70499305 6.75,9.5475 C6.7484414,9.34193445 6.90964354,9.17189932 7.115,9.1625 L7.115,9.1625 Z M5.75,9.765 C6.13,9.5875 6.5475,9.6775 6.68,9.9675 C6.8125,10.2575 6.625,10.635 6.25,10.8125 C6.12707576,10.8701293 5.99325221,10.9008149 5.8575,10.9025 C5.63577697,10.9190371 5.42511864,10.80342 5.32,10.6075 C5.18,10.32 5.3775,9.9425 5.75,9.765 Z"></path>
              <path fill="currentColor" d="M7.305,13.3975 C10.555,13.3975 13.155,11.675 13.155,9.5475 C13.155,7.7525 10.94,7.7525 10.94,7.635 C10.94,7.5175 12.045,6.4775 10.94,5.8275 C10.28,5.4375 9.29,5.6375 8.615,5.8275 C8.37593476,5.92066948 8.13025327,5.9958781 7.88,6.0525 C8.75,4.535 7.51,4.0525 6.88,4.0525 C5.38,4.0525 1.4325,7.41 1.4325,9.535 C1.4325,11.66 4.06,13.3975 7.305,13.3975 L7.305,13.3975 Z M6.7675,7.2625 C8.84,6.97 10.6775,7.845 10.87,9.2125 C11.0625,10.58 9.5375,11.9275 7.4625,12.2125 C7.19993139,12.2492176 6.93512346,12.2675954 6.67,12.2675004 C4.94,12.2675004 3.53,11.4525 3.3625,10.2675 C3.17,8.9 4.695,7.5525 6.7675,7.2625 L6.7675,7.2625 Z"></path>
              <path fill="currentColor" d="M12.1975,6.94 L12.4475,6.94 C12.6059157,6.93686389 12.7404701,6.82317064 12.77,6.6675 C12.77,6.6675 13.065,5.525 12.38,4.9 C12.0543816,4.60954157 11.6312754,4.45243883 11.195,4.46 C11.06222,4.45779075 10.9296415,4.47121643 10.8,4.5 C10.6460069,4.52717522 10.5322284,4.65869897 10.5275,4.815 L10.5275,4.9225 C10.523244,4.99648918 10.5520351,5.06855315 10.6061021,5.11924105 C10.6601692,5.16992894 10.7339389,5.19401568 10.8075,5.185 C10.8075,5.185 11.5575,5.0825 11.9225,5.5225 C12.2875,5.9625 12.0025,6.675 12.0025,6.675 C11.9769169,6.73717397 11.9856249,6.80819055 12.0254718,6.86234147 C12.0653188,6.9164924 12.1305304,6.94593085 12.1975,6.94 Z"></path>
            </svg>
            官方微博
          </a>

        </div>
        
        <div class="info-row">
          客服热线：010-67410388
        </div>
        
        <div class="info-row">
          客服邮箱：<a href="mailto:kefu@chsi.com.cn">kefu@chsi.com.cn</a>
        </div>
      </div>

    </div>
  </footer>
</template>

<script setup lang="ts">
const navLinks = [
  { name: '学信网', url: 'https://www.chsi.com.cn/' },
  { name: '中心简介', url: 'https://chesicc.chsi.com.cn/zxgw/zxjs/201604/20160418/1529506207.html' },
  { name: '关于我们', url: 'https://yz.chsi.com.cn/doc/about.jsp' },
  { name: '版权声明', url: 'https://yz.chsi.com.cn/doc/copyright.jsp' },
  { name: '帮助中心', url: 'https://yz.chsi.com.cn/help/' },
  { name: '网站地图', url: 'https://yz.chsi.com.cn/sitemap.jsp' },
  { name: '网站宣传', url: 'https://www.chsi.com.cn/ad/202403/20240322/2293272455.html' },
]
</script>

<style scoped>
.yz-footer {
  width: 100%;
  height: 198px; 
  background-color: #282828;
  color: #ABABAB;
  font-size: 14px;
  box-sizing: border-box;
  display: flex;
  align-items: center; 
  font-family: "Helvetica Neue", Helvetica, "PingFang SC", "Hiragino Sans GB", "Microsoft YaHei", "\5FAE\8F6F\96C5\9ED1", Arial, sans-serif;
}

.footer-container {
  width: 1180px; 
  margin: 0 auto; 
  display: flex;
  justify-content: space-between; 
  align-items: flex-start; 
}

.footer-left {
  display: flex;
  flex-direction: column;
  gap: 16px; 
}

.footer-right {
  display: flex;
  flex-direction: column;
  align-items: flex-start; 
  gap: 16px; 
}

.nav-links a {
  margin-right: 25px;
}

.info-row {
  line-height: 1;
}

/* 链接及图标颜色的同步控制 */
a {
  color: #ABABAB;
  text-decoration: none;
  transition: color 0.2s, text-decoration 0.2s;
}

a:hover {
  color: #666666;
  text-decoration: underline;
}

.social-links {
  display: flex;
  gap: 25px;
}

.social-btn {
  display: flex;
  align-items: center;
  gap: 6px; 
}

/* 控制 SVG 的显示大小 */
.social-icon {
  width: 16px;
  height: 16px;
}

.beian-info {
  display: flex;
  align-items: center;
  gap: 20px;
}

.gongan-beian {
  display: flex;
  align-items: center;
  gap: 6px;
}

.gongan-beian img {
  width: 16px;
  height: 16px;
}

/* 移动端适配 */
@media screen and (max-width: 768px) {
  .yz-footer {
    height: auto; /* 取消定高，由内容撑开 */
    padding: 30px 20px;
  }
  .footer-container {
    width: 100%;
    flex-direction: column; /* 左右两块变成上下排布 */
    gap: 30px;
  }
  .footer-left, .footer-right {
    width: 100%;
  }
  .nav-links a {
    display: inline-block;
    margin-bottom: 10px;
    margin-right: 15px;
  }
  /* 备案信息拆分防拥挤 */
  .beian-info {
    flex-direction: column;
    align-items: flex-start;
    gap: 10px;
  }
}
</style>